app/controllers/discussions_controller.rb

SELECT `discussions`.* FROM `discussions` ORDER BY created_at desc
---
  def index
    @discussions = Discussion.all.order('created_at desc')

INSERT INTO `discussions` (`title`, `content`, `created_at`, `updated_at`, `user_id`, `channel_id`, `slug`) VALUES ('Hello', 'How are you??', '2018-09-01 11:18:32', '2018-09-01 11:18:32', 1, 1, 'hello')
---
  def create
    @discussion = current_user.discussions.build(discussion_params)

    respond_to do |format|
      if @discussion.save

DELETE FROM `discussions` WHERE `discussions`.`id` = 1
---
  def destroy
    @discussion.destroy

SELECT `channels`.* FROM `channels` ORDER BY created_at desc
---
    def find_channels
      @channels = Channel.all.order('created_at desc')